{
  "projects": [
    {
      "projectName": "Risk-free stock platform",
      "projectTools": [
        "FaReact",
        "FaHtml5",
        "FaSass",
        "FaNodeJs",
        "DiMysql",
        "DiPython"
      ],
      "projectDescription": "A completely risk-free platform for buying and selling stocks developed by me and six other people during the summer of 2020. The end goal of the application is to give kids and young adults an easy and loss-free way of learning about the stock market and how to trade in a responsible and profitable manner. The research on how to best educate younger people on how the stock market works is currently being done by Nils Fohlin as part of his master thesis. In the meantime the project is on hold, but you can still use the platform to buy and sell stocks on the Swedish market.",
      "projectLinks": ["https://www.epictetus.dev/landing-page"]
    },
    {
      "projectName": "GeoReminders",
      "projectTools": ["FaJava", "FaAndroid", "DiMysql"],
      "projectDescription": "An Android applikation to store reminders/tasks on geo-locations using the Google Maps Geolocation API. The stores long/lat-coordinates along with the reminder information and sends the user a notification when they return to the location.",
      "projectLinks": ["https://github.com/DavidAEriksson/GeoReminders"]
    },
    {
      "projectName": "Apartyment",
      "projectTools": ["FaReact", "SiFirebase", "FaNodeJs"],
      "projectDescription": "Apartyment is an application that helps users host and attend 'bicycle parties' and 'apartment rounds' which are common events at Swedish universities. The application helps the organizers generate a schedule for all of the group-stations throughout the evening, and a user can join the event through a 5-digit code. The application is built in React-Native and uses Cloud Firestore to manage and store all of the data.",
      "projectLinks": ["https://github.com/pumaht20"]
    },
    {
      "projectName": "input-validators-js",
      "projectTools": ["FaNodeJs", "DiJavascript1"],
      "projectDescription": "I got tired of looking up different kinds of regular expressions for input validation so I made my own npm-package which has a number of different functions that helps you regex forms.",
      "projectLinks": [
        "https://github.com/DavidAEriksson/input-validators-js",
        "https://www.npmjs.com/package/input-validators-js"
      ]
    },
    {
      "projectName": "Idag & Inatt",
      "projectTools": ["FaHtml5", "FaCss3Alt", "DiPhotoshop", "DiIllustrator"],
      "projectDescription": "Every year, my university programme holds a smaller job fair strictly for students within the programme. This is done partially to network with different organizations, celebrate the past year, and to send off the 4:th grade students. For the 2019 event, I was in charge of the PR-department, which mainly involved creating graphics for the event and re-designing the event page for the theme of the year.",
      "projectLinks": ["http://idag.interaktion.nu/"]
    },
    {
      "projectName": "Outdoor Navigation Treasure Hunt",
      "projectTools": ["FaUnity"],
      "projectDescription": "A project me and four other students worked on together with THNX Innovation for the course 'Design-Build-Test' at Umeå University. The specification of the project was decided together with the team at THNX; build an Android application that is capable of directing a AR-figure to real world points of interests. The application was meant to be a spring-board prototype for a currently existing application that was developed in-house by THNX Innovation called 'TiHi på Skattjakt'.",
      "projectLinks": [""]
    },
    {
      "projectName": "Thirty",
      "projectTools": ["FaJava", "FaAndroid"],
      "projectDescription": "A simple Dice Game to learn the foundations of Android Development that I did for the course 'Development of Mobile Applications' at Umeå University. The game is a slightly different version of 'Yahtzee' where the goal of the game is to get as many points as possible by matching the value of six dice to the value of a score-spinner.",
      "projectLinks": ["https://github.com/DavidAEriksson/Thirty"]
    }
  ]
}
